{
  "ActLikeIt:ForkInTheRoad": {
    "NAME": "Fork in the Road",
    "DESCRIPTIONS": [
      "You ascend further. NL Here there is a split in the road. NL To the left leads a swirling wasteland of surreal shapes. NL To the right a massive metal structure looms. NL You consider your options."
    ],
    "OPTIONS": [
      "[Go Somewhere] Choose randomly."
    ]
  },
  "theFactory:Flying": {
    "NAME": "Flying",
    "DESCRIPTIONS": [
      "As you head upwards jumping about derelict machine parts, you slip. NL NL You begin to ... float upwards. NL Looking up, a large magnet has begun to pull you towards it. NL You consider your options.",
      "You use a super-showy move to leap out of the magnet's range and deftly land on a crate.",
      "You hold still. NL Flying ever faster, you #rSLAM into the magnet, then fall to the ground with a #rWHUMPF. NL You feel #rquite #rinjured ...",
      "You empty your pockets. NL Before you can levitate further, you fall to the hard ground. NL NL You continue onwards, wistful of lost trinkets..."
    ],
    "OPTIONS": [
      "[Dodge] #rLose #ra #rrandom #rRare #rcard.",
      "[Don't Dodge] #rBecome #rCursed #r- #r2x #rInjury.",
      "[Drop Metal] #rLose #ryour #r2 #rrightmost #rRelics.",
      "[Leave]",
      "[Locked] Requires: Rare Card",
      "[Leave]"
    ]
  },
  "theFactory:BodyBloom": {
    "NAME": "Body Bloom",
    "DESCRIPTIONS": [
      "As you travel through the madness of the Factory, curious machines call to you. NL Your body suddenly feels very malleable... NL You can tell these machines can augment you. NL What will you do?",
      "No petty trinkets. Only pure power.",
      "No fear. Only madness.",
      "No loss. Only more."
    ],
    "OPTIONS": [
      "[I am Asleep] #rLose #rall #rCommon, #rUncommon #ror #rRare #rRelics. #gUpgrade #gall #gCards.",
      "[I am Sick] #gHeal #gto #gfull #gHP. #rBecome #rCursed #r- #r???.",
      "[I am Peace] #rLose #r9 #rHP. #gObtain #ga #gCommon #grelic.",
      "[Leave]",
      "[Leave]"
    ]
  },
  "theFactory:MemoryStone": {
    "NAME": "Brainless Rock",
    "DESCRIPTIONS": [
      "Descending through the Factory, you encounter a ~shifting~ hunk of metal ~suspended~ by iron cords.",
      "You touch it. A sharp #rpain flows through you, followed by #punfamiliar inspiration. NL Ideas and images shoot through your head."
    ],
    "OPTIONS": [
      "[Brainstorm] #gAdd #g1 #gcard #gfrom #gANY #gclass #ginto #gyour #gdeck.",
      "[Brainstorm] #gAdd #g2 #gcards #gfrom #gANY #gclass #ginto #gyour #gdeck. #rLose #r5 #rHP.",
      "[Brainstorm] #gAdd #g3 #gcards #gfrom #gANY #gclass #ginto #gyour #gdeck. #rLose #r10 #rHP.",
      "[Leave]"
    ]
  },
  "theFactory:SharkMouth": {
    "NAME": "Shark Head",
    "DESCRIPTIONS": [
      "You happen upon an item that feels ~extremely~ unthematic. NL A massive shark's head juts out of the iron patchwork wall ahead of you. NL The shark's mouth is open, revealing ~sharp~ #ygolden teeth. NL Its eyes dart back and forth before staring at you intently. NL Looks friendly enough...",
      "You stick your hand inside the shark's mouth carefully. NL It looks at you, winks, and #rbites #rdown. NL You recoil in pain and pull your hand out immediately. NL Embedded in your palm is a single #ygolden tooth from the shark. NL It winks again at you. NL NL Grateful and confused, you continue onwards.",
      "You deposit your relic into the shark's mouth with care. NL It stares at you before #rbiting it into pieces. NL You feel ~invigorated~ by the experience somehow. NL NL You continue onwards, grateful.",
      "You continue onwards, wary. NL NL The shark gives you a lonely look as you leave."
    ],
    "OPTIONS": [
      "[Deposit Hand] #gGain #g333 #gGold. #rLose #r10 #rHP.",
      "[Deposit ",
      "] #rLose #rthis #rrelic. #gHeal #gfor #g33% #gof #gyour #gMax #gHP.",
      "[Leave]",
      "[Leave]"
    ]
  },
  "theFactory:WindingCorridors": {
    "NAME": "Winding Corridors",
    "DESCRIPTIONS": [
      "As you hurriedly progress through the ~twisting~ and ~turning~ @tight@ corridors of the Factory, you begin to feel confused and frustrated. The cubicles, gears and pistons are loud and disorienting and soon you find yourself #rlost.",
      "You concentrate on the directions you progress and attempt to chart out this maddening location. NL You feel #rweak from thinking for so long. NL NL You continue ascending...",
      "You use your #pweapons to bash through the metal walls and charge straight ahead. NL NL The robotic assailants in the next room are #r@enraged@ by this and charge for you! NL NL Oh no!"
    ],
    "OPTIONS": [
      "[Chart Path] #rDowngrade #r2 #rcards #rrandomly.",
      "[Rush Through] #rALL #renemies #rin #rthe #rnext #rcombat #rstart #rcombat #rwith #r3 #rStrength.",
      "[Proceed]"
    ]
  },
  "theFactory:TroubledShopkeep": {
    "NAME": "Shopkeep In Trouble",
    "DESCRIPTIONS": [
      "In the next cube of hivelike robotic activity, you see a familiar blue figure accosted by several bulky robots. NL NL \"Hey! You! Beloved customer! HELP ME!!!\" they yell as they begin to approach. You have a feeling they will not make it out of this one OK without your help.",
      "You rush in and dispatch the bots, getting a few wounds in return. The merchant is extremely grateful. \"Thank you! Thank you so much, I was terrified! Here, have this.\" They bestow upon you a useful trinket and proceed upon their own way. NL NL You continue...",
      "You turn around and run away. NL NL The merchant's screams echo in your ears as you flee..."
    ],
    "OPTIONS": [
      "[Intervene] #rLose #r16 #rHP. #gObtain #ga #gShop #grelic.",
      "[Run] #rThe #rShopkeeper #rdies.",
      "[Leave]"
    ]
  }
}